//
//  SelectFacDepViewController.swift
//  match
//
//  on 2021/03/22.
//

import UIKit

class SelectFacDepViewController: UIViewController, UITextFieldDelegate, UIPickerViewDelegate, UIPickerViewDataSource {
    
    
    private var pickerView: UIPickerView = UIPickerView()
    private var active_textfield : UITextField!
    private var current_arr : [String] = []

    @IBOutlet weak var facTextField: UITextField!
    @IBOutlet weak var depTextField: UITextField!
    
    public var uni = ""
    
    
    private let facultyList: [String: [String]] =
        [ "選んでください":["先に大学を選択してください"],
          "早稲田大学": ["政治経済学部","法学部","商学部","国際教育学部","社会科学部","教育学部","文学部","文化構想学部","スポーツ学部","人間科学部","基幹理工学部","創造理工学部","先進理工学部"],
          "慶應義塾大学":["文学部","経済学部","法学部","商学部","医学部","理工学部","総合政策学部","環境情報学部","看護医療学部","薬学部"],
          "上智大学":["神学部","文学部","総合人間科学部","法学部","経済学部","外国語学部","総合グローバル学部","国際教養学部","理工学部"],
          "東京理科大学":
            ["理学部第一部", "工学部", "薬学部", "理工学部", "先進工学部", "経営学部", "理学部第二部"],
          "学習院大学":
            ["法学部", "文学部", "経済学部", "理学部", "国際社会学部"],
          "明治大学":["法学部","商学部","政治経済学部","文学部","理工学部","農学部","経営学部","情報コミュニケーション学部","国際日本学部","総合数理学部"],
          "青山学院大学":["文学部","教育人間科学部","経済学部","法学部","経営学部","国際政治経済学部","総合文化政策学部","理工学部","社会情報学部","地球社会共生学部","コミュニティ人間科学部"],
          "立教大学":["文学部","異文化コミュニケーション学部","経済学部","経営学部","社会学部","法学部","理学部","観光学部","コミュニティ福祉学部","現代心理学部","グローバル リベラルアーツ プログラム"],
          "中央大学":
            ["法学部","経済学部","商学部","理工学部","文学部","総合政策学部","国際経営学部","国際情報学部"],
          "法政大学":["法学部","文学部","経営学部","国際文化学部","人間環境学部","キャリアデザイン学部","デザイン工学部","グローバル教養学部","経済学部","社会学部","現代福祉学部","スポーツ健康学部","情報科学部","理工学部","生命科学部"],
          "日本大学":
              ["法学部", "文理学部", "経済学部", "商学部", "芸術学部", "国際関係学部", "危機管理学部", "スポーツ科学部", "理工学部", "生産工学部", "工学部", "医学部", "歯学部", "松戸歯学部", "生物資源科学部", "薬学部", "通信教育部", "短期大学部"],
          "東洋大学" :
              ["文学部", "経済学部", "経営学部", "法学部", "社会学部", "国際学部", "国際観光学部", "国際地域学部", "情報連携学部", "ライフデザイン学部", "理工学部", "総合情報学部", "生命科学部", "食環境科学部"],
          "駒澤大学" :
              ["仏教学部", "文学部", "経済学部", "法学部", "経営学部", "医療健康科学部", "グローバル・メディア・スタディーズ学部", "総合教育研究部"],
          "専修大学":
              ["経済学部", "法学部", "経営学部", "商学部", "文学部", "ネットワーク情報学部", "人間科学部", "国際コミュニケーション学部", "二部"],
          "帝京大学":
              ["医学部", "薬学部", "経済学部", "法学部", "文学部", "外国語学部", "教育学部", "理工学部", "医療技術学部", "福岡医療技術学部"],
          "神奈川大学":
              ["法学部", "経済学部", "経営学部", "外国語学部", "国際日本学部", "人間科学部", "理学部", "工学部", "建築学部"],
          "成蹊大学":
            ["経済学部", "経営学部", "法学部", "文学部", "理工学部"],
          "明治学院大学":
            ["文学部", "経済学部", "社会学部", "法学部", "国際学部", "心理学部"],
          "桜美林大学":
              ["リベラルアーツ学群", "グローバル・コミュニケーション学群", "ビジネスマネジメント学群", "健康福祉学群", "芸術文化学群", "航空・マネジメント学群"],
          "名城大学":
            ["法学部", "経営学部", "経済学部", "外国語学部", "人間学部", "都市情報学部", "理工学部", "農学部", "薬学部", "情報工学部"],
          "近畿大学":
              ["法学部", "経済学部", "経営学部", "建築学部", "理工学部", "薬学部", "文芸学部", "総合社会学部", "国際学部", "農学部", "医学部", "生物理工学部", "工学部", "情報学部", "産業理工学部", "短期大学部", "通信教育部"],
          "立命館大学":
              ["法学部", "産業社会学部", "国際関係学部", "文学部", "映像学部", "経営学部", "政策科学部", "総合心理学部", "グローバル教養学部", "経済学部", "スポーツ健康科学部", "食マネジメント学部", "理工学部", "情報理工学部", "生命科学部", "薬学部"],
          "関西大学":
              ["法学部", "文学部", "経済学部", "商学部", "社会学部", "政策創造学部", "外国語学部", "人間健康学部", "総合情報学部", "社会安全学部", "システム理工学部", "環境都市工学部", "化学生命工学部"],
          "同志社大学":
            ["神学部", "文学部", "社会学部", "法学部", "経済学部", "商学部", "政策学部", "文化情報学部", "理工学部", "生命医科学部", "スポーツ健康科学部", "心理学部", "グローバル・コミュニケーション学部", "グローバル地域文化学部"],
          "関西学院大学":
            ["神学部", "文学部", "社会学部", "法学部", "経済学部", "商学部", "人間福祉学部", "国際学部", "教育学部", "総合政策学部", "理学部", "工学部", "生命環境学部", "建築学部"],
          "龍谷大学":
            ["文学部", "経済学部", "経営学部", "法学部", "政策学部", "国際学部", "先端理工学部", "社会学部", "農学部"],
          "福岡大学":
            ["人文学部", "法学部", "経済学部", "商学部", "商学部第二部", "理学部", "工学部", "医学部", "薬学部", "スポーツ科学部"],
          "武庫川女子大学":
            ["文学部", "教育学部", "健康・スポーツ科学部", "生活環境学部", "食物栄養科学部", "建築学部", "音楽学部", "薬学部", "看護学部", "経営学部"],
          "大妻女子大学":
            ["家政学部", "文学部", "社会情報学部", "人間関係学部", "比較文化学部"],
          "日本女子大学":
            ["家政学部", "文学部", "人間社会学部", "理学部"],
          "東京大学":
            ["教養学部", "法学部", "経済学部", "文学部", "教育学部", "工学部", "理学部", "農学部", "薬学部", "医学部"],
          "京都大学":
            ["総合人間学部", "文学部", "教育学部", "法学部", "経済学部", "理学部", "医学部", "薬学部", "工学部", "農学部"],
          "名古屋大学":
            ["文学部", "教育学部", "法学部", "経済学部", "情報学部", "理学部", "医学部", "工学部", "農学部"],
          "大阪大学":
            ["文学部", "人間科学部", "外国語学部", "法学部", "経済学部", "理学部", "医学部", "歯学部", "薬学部", "工学部", "基礎工学部"],
          "九州大学":
            ["共創学部", "文学部", "教育学部", "法学部", "経済学部", "理学部", "医学部", "歯学部", "薬学部", "工学部", "芸術工学部", "農学部"],
          "神戸大学":
            ["文学部", "国際人間科学部", "法学部", "経済学部", "経営学部", "理学部", "医学部", "工学部", "農学部", "海洋政策科学部"],
          "北海道大学":
            ["文学部", "教育学部", "法学部", "経済学部", "理学部", "医学部", "歯学部", "薬学部", "工学部", "農学部", "獣医学部", "水産学部"],
          "東北大学":
            ["文学部", "教育学部", "法学部", "経済学部", "理学部", "医学部", "歯学部", "薬学部", "工学部", "農学部"],
          "東京工業大学":
            ["理学院", "工学院", "物質理工学院", "情報理工学院", "生命理工学院", "環境・社会理工学院"],
          "一橋大学":
            ["商学部", "経済学部", "法学部", "社会学部"],
          "横浜国立大学":
            ["教育学部", "経済学部", "経営学部", "理工学部", "都市科学部"],
          "筑波大学":
            ["人文・文化学群", "社会・国際学群", "人間学群", "生命環境学群", "理工学群", "情報学群", "医学群", "体育専門学群", "芸術専門学群"],
          "京都産業大学":
            ["経済学部", "経営学部", "法学部", "現代社会学部", "国際関係学部", "外国語学部", "文化学部", "理学部", "情報理工学部", "生命科学部"],
          "東京農業大学":
            ["農学部", "応用生物科学部", "生命科学部", "地域環境科学部", "国際食料情報学部", "生物産業学部"],
          "中京大学":
            ["国際学部", "文学部", "心理学部", "法学部", "経済学部", "経営学部", "総合政策学部", "現代社会学部", "工学部", "スポーツ科学部"],
          "国士舘大学":
            ["政経学部", "体育学部", "理工学部", "法学部", "文学部", "２１世紀アジア学部", "経営学部"]
        
    ]
    
    
    
    
    
    
    
    
    
    
    private let departmentList: [String: [String: [String]]] =
    [
        "選んでください":["先に大学を選択してください": ["先に学部を選んでください"]],
        "早稲田大学":
            ["政治経済学部": ["","政治学科","経済学科","国際政治経済学科"],
             "法学部": [""],
             "商学部": ["","経営トラック","会計トラック","マーケティング・国際ビジネストラック","金融・保険トラック","経済トラック","産業トラック"],
             "国際教育学部": ["","国際教養学科"],
             "社会科学部":["","社会科学科"],
             "教育学部": ["","教育学科","国語国文学科","英語英文学科","社会科","理学科","数学科","複合文化学科"],
             "文学部": [""],
             "文化構想学部": ["","文化構想学科"],
             "スポーツ学部": ["","スポーツ科学科"],
             "人間科学部": ["","人間環境科学科", "健康福祉科学科", "人間情報科学科"],
             "基幹理工学部": ["","学系Ⅰ","学系Ⅱ","学系Ⅲ","数学科","応用数理学科","機械科学・航空宇宙学科","電子物理システム学科","情報理工学科","情報通信学科","表現工学科"],
             "創造理工学部": ["","建築学科","総合機械工学科","経営システム工学科","社会環境工学科","環境資源工学科"],
             "先進理工学部": ["","物理学科","応用物理学科","化学・生命化学科","応用化学科","生命医科学科","電気・情報生命工学科"]
        ],
        "慶應義塾大学":
            ["文学部": ["","人文社会学科"],
             "経済学部": ["","経済学科"],
             "法学部": ["","法律学科", "政治学科"],
             "商学部": ["","商学科"],
             "医学部": ["","医学科"],
             "理工学部": ["","機械工学科","電気情報工学科","応用化学科","物理情報工学科","管理工学科","数理科学科","物理学科","化学科","システムデザイン工学科","情報工学科","生命情報学科"],
             "総合政策学部": ["","総合政策学科"],
             "環境情報学部": ["","環境情報学科"],
             "看護医療学部": ["","看護学科"],
             "薬学部": ["","薬学科","薬科学科"]
        ],
        "上智大学":
            ["神学部": ["","神学科"],
             "文学部": ["","哲学科","史学科","国文学科","英文学科","ドイツ文学科","フランス文学科","新聞学科"],
             "総合人間科学部": ["","教育学科","心理学科","社会学科","社会福祉学科","看護学科"],
             "法学部": ["","法律学科","国際関係法学科","地球環境法学科"],
             "経済学部": ["","経済学科","経営学科"],
             "外国語学部": ["","英語学科","ドイツ語学科","フランス語学科","イスパニア語学科","ロシア語学科","ポルトガル語学科"],
             "総合グローバル学部": ["","総合グローバル学科"],
             "国際教養学部": ["","国際教養学科"],
             "理工学部": ["","物質生命理工学科","機能創造理工学科","情報理工学科"]
        ],
        "東京理科大学":
            ["理学部第一部":
                ["", "数学科", "物理学科", "化学科", "応用数学科",
                 "応用物理学科", "応用化学科"],
             "工学部":
                ["", "薬学部", "建築学科", "工業化学科", "電気工学科", "情報工学科",
                 "機械工学科"],
             "薬学部": ["", "薬学科", "生命創薬科学科"],
             "理工学部": ["", "数学科", "物理学科", "情報科学科", "応用生物科学科", "建築学科", "先端化学科", "電気電子情報工学科", "経営工学科", "機械工学科", "土木工学科"],
             "先進工学部": ["", "電子システム工学科", "創成工学科", "生命システム工学科"],
             "経営学部": ["", "経営学科", "ビジネスエコノミクス学科", "国際デザイン経営学科"],
             "理学部第二部": ["", "数学科", "物理学科", "化学科"],
        ],
        "学習院大学":
            ["法学部": ["", "法学科", "政治学科"],
             "文学部": ["", "哲学科", "史学科", "日本語日本文学科", "英語英米文化学科", "ドイツ語圏文化学科", "フランス語圏文化学科", "心理学科", "教育学科"],
             "経済学部": ["", "経済学科", "経営学科"],
             "理学部": ["", "物理学科", "化学科", "数学科", "生命科学科"],
             "国際社会学部": [""]
            ],
        "明治大学":
            ["法学部": ["","法律学科"],
             "商学部": ["","商学科"],
             "政治経済学部": ["","政治学科","経済学科","地域行政学科"],
             "文学部": ["","文学科","史学地理学科","心理社会学科"],
             "理工学部": ["","電気電子生命学科","機械工学科","機械情報工学科","建築学科","応用化学科","情報科学科","数学科","物理学科"],
             "農学部": ["","農学科","農芸化学科","生命科学科","食料環境政策学科"],
             "経営学部": ["","経営学科","会計学科","公共経営学科"],
             "情報コミュニケーション学部": ["","情報コミュニケーション学科"],
             "国際日本学部": ["","国際日本学科"],
             "総合数理学部": ["","現象数理学科","先端メディアサイエンス学科","ネットワークデザイン学科"]
        ],
        "青山学院大学":
            ["文学部": ["","英米文学科","フランス文学科","日本文学科","史学科","比較芸術学科"],
             "教育人間科学部": ["","教育学科","心理学科"],
             "経済学部": ["","経済学科","現代経済デザイン学科"],
             "法学部": ["","法学科"],
             "経営学部": ["","経営学科","マーケティング学科"],
             "国際政治経済学部": ["","国際政治学科","国際経済学科","国際コミュニケーション学科"],
             "総合文化政策学部": ["","総合文化政策学科"],
             "理工学部": ["","物理科学科","数理サイエンス学科","化学・生命科学科","電気電子工学科","機械創造工学科","経営システム工学科","情報テクノロジー学科"],
             "社会情報学部": ["","社会情報学科"],
             "地球社会共生学部": ["","地球社会共生学科"],
             "コミュニティ人間科学部": ["","コミュニティ人間科学科"]
        ],
        "立教大学":
            ["文学部": ["","キリスト教学科","文学科","史学科","教育学科"],
             "異文化コミュニケーション学部": ["","異文化コミュニケーション学科"],
             "経済学部": ["","経済学科","経済政策学科","会計ファイナンス学科"],
             "経営学部": ["","経営学科","国際経営学科"],
             "社会学部": ["","社会学科","現代文化学科","メディア社会学科"],
             "法学部": ["","法学科","国際ビジネス法学科","政治学科"],
             "理学部": ["","数学科","物理学科","化学科","生命理学科"],
             "観光学部": ["","観光学科","交流文化学科"],
             "コミュニティ福祉学部": ["","コミュニティ政策学科","福祉学科","スポーツウエルネス学科"],
             "現代心理学部": ["","心理学科","映像身体学科"],
             "グローバル リベラルアーツ プログラム": [""]
        ],
        "中央大学":
            ["法学部": ["","法律学科","国際企業関係法学科","政治学科"],
             "経済学部": ["","経済学科","経済情報システム学科","国際経済学科","公共・環境経済学科"],
             "商学部": ["","経営学科","会計学科","商業・貿易学科","金融学科"],
             "理工学部": ["","数学科","物理学科","都市環境学科","精密機械工学科","電気電子情報通信工学科","応用化学科","ビジネスデータサイエンス学科","情報工学科","生命科学科","人間総合理工学科"],
             "文学部": ["","国文学専攻","英語文学文化専攻","ドイツ語文学文化専攻","フランス語文学文化専攻","中国言語文化専攻","日本史学専攻","東洋史学専攻","西洋史学専攻","哲学専攻","社会学専攻","社会情報学専攻","教育学専攻","心理学専攻","学びのパスポートプログラム"],
             "総合政策学部": ["","政策科学科","国際政策文化学科"],
             "国際経営学部": ["","国際経営学科"],
             "国際情報学部": ["","国際情報学科"]
            ],
        "法政大学":
            ["法学部": ["","法律学科","政治学科","国際政治学科"],
             "文学部": ["","哲学科","日本文学科","英文学科","史学科","地理学科","心理学科"],
             "経営学部": ["","経営学科","経営戦略学科","市場経営学科"],
             "経済学部": ["","経済学科","国際経済学科","現代ビジネス学科"],
             "社会学部": ["","社会政策科学科","社会学科","メディア社会学科"],
             "国際文化学部": ["","国際文化学科"],
             "人間環境学部": ["","人間環境学科"],
             "キャリアデザイン学部": ["","キャリアデザイン学科"],
             "デザイン工学部": ["","建築学科","都市環境デザイン工学科","システムデザイン学科"],
             "グローバル教養学部": ["","グローバル教養学科"],
             "現代福祉学部": ["","福祉コミュニティ学科"],
             "スポーツ健康学部": ["","スポーツ健康学科"],
             "情報科学部": ["","コンピュータ科学科","ディジタルメディア学科"],
             "理工学部": ["","機械工学科","電気電子工学科","応用情報工学科","経営システム工学科","創生科学科"],
             "生命科学部": ["","生命機能学科","環境応用化学科","応用植物科学科"]
            ],
        "日本大学":
            ["法学部": ["", "法律学科", "政治経済学科", "新聞学科", "経営法学科", "公共政策学科"],
             "文理学部": ["", "哲学科", "史学科", "国文学科", "中国語中国文化学科", "英文学科", "ドイツ文学科", "社会学科", "社会福祉学科", "教育学科", "体育学科", "心理学科", "地理学科", "地球科学科", "数学科", "情報科学科", "物理学科", "生命科学科", "化学科"] ,
             "経済学部": ["", "経済学科", "産業経営学科", "金融公共経済学科"],
             "商学部": ["", "商業学科", "経営学科", "会計学科"],
             "芸術学部": ["", "写真学科", "映画学科", "美術学科", "音楽学科", "文芸学科", "演劇学科", "放送学科", "デザイン学科"],
             "国際関係学部": ["", "国際総合政策学科", "国際教養学科"],
             "危機管理学部": [""],
             "スポーツ科学部": [""],
             "理工学部": ["", "土木工学科", "交通システム工学科", "建築学科", "海洋建築工学科", "まちづくり工学科", "機械工学科", "精密機械工学科", "航空宇宙工学科", "電気工学科", "電子工学科", "応用情報工学科", "物質応用化学科", "物理学科", "数学科"],
             "生産工学部": ["", "機械工学科", "電気電子工学科", "土木工学科", "建築工学科", "応用分子化学科", "マネジメント工学科", "数理情報工学科", "環境安全工学科", "創生デザイン学科"],
             "工学部": ["", "土木工学科", "建築学科", "機械工学科", "電気電子工学科", "生命応用化学科", "情報工学科"],
             "医学部": ["", "医学科"],
             "歯学部": ["", "歯学科"],
             "松戸歯学部": ["", "歯学科"],
             "生物資源科学部": ["", "生命農学科", "生命化学科", "獣医学科", "動物資源科学科", "食品ビジネス学科", "森林資源科学科", "海洋生物資源科学科", "生物環境工学科", "食品生命学科", "国際地域開発学科", "応用生物科学科", "くらしの生物学科"],
             "薬学部": ["", "薬学科"],
             "通信教育部": ["", "法律学科", "政治経済学科", "文学専攻（国文学）", "文学専攻（英文学）", "哲学専攻", "史学専攻", "経済学科", "商業学科"],
             "短期大学部": [""]
        ],
        "東洋大学" :
            ["文学部": ["", "哲学科", "インド哲学科", "英米文学科", "教育学科", "英語コミュニケーション学科", "東洋思想文化学科", "日本文学文化学科", "史学科", "国際文化コミュニケーション学科"],
             "経済学部": ["", "経済学科", "総合政策学科", "国際経済学科"],
             "経営学部": ["", "経営学科", "会計ファイナンス学科", "マーケティング学科"],
             "法学部": ["", "法律学科", "企業法学科"],
             "社会学部": ["", "社会学科", "社会福祉学科", "社会心理学科", "社会文化システム学科", "メディアコミュニケーション学科", "国際社会学科"],
             "国際学部": ["", "グローバル・イノベーション学科", "国際地域学科 国際地域専攻"],
             "国際観光学部": [""],
             "国際地域学部": ["", "国際地域学科 国際地域専攻", "国際観光学科"],
             "情報連携学部": [""],
             "ライフデザイン学部": ["", "生活支援学科 生活支援学専攻", "健康スポーツ学科", "生活支援学科 子ども支援学専攻", "人間環境デザイン学科"],
             "理工学部": ["", "機械工学科", "電気電子情報工学科", "都市環境デザイン学科", "生体医工学科", "応用化学科", "建築学科"],
             "総合情報学部": [""],
             "生命科学部": ["", "生命科学科", "応用生物科学科"],
             "食環境科学部": ["", "食環境科学科", "健康栄養学科"]
        ],
        "駒澤大学" :
            ["仏教学部": ["", "禅学科", "仏教学科"],
             "文学部": ["", "国文学科", "英米文学科", "地理学科", "歴史学科", "社会学科", "心理学科"],
             "経済学部": ["", "経済学科", "商学科", "現代応用経済学科"],
             "法学部": ["", "法律学科", "政治学科"],
             "経営学部": ["", "経営学科", "市場戦略学科"],
             "医療健康科学部": ["", "診療放射線技術科学科"],
             "グローバル・メディア・スタディーズ学部": ["", "グローバル・メディア学科"],
             "総合教育研究部": ["", "文化学部門", "自然科学部門", "教職課程部門", "日本文化部門", "スポーツ・健康科学部門", "外国語第一部門(英語）", "外国語第二部門"]
        ],
        "専修大学":
            ["経済学部": ["", "現代経済学科", "生活環境経済学科", "国際経済学科", "経済学科"],
             "法学部": ["", "法律学科", "政治学科"],
             "経営学部": ["", "ビジネスデザイン学科", "経営学科"],
             "商学部": ["", "マーケティング学科", "会計学科"],
             "文学部": ["", "日本語学科", "日本文学文化学科", "英語英米文学科", "哲学科", "歴史学科", "環境地理学科", "ジャーナリズム学科"],
             "ネットワーク情報学部": ["", "ネットワーク情報学科"],
             "人間科学部": ["", "心理学科", "社会学科"],
             "国際コミュニケーション学部": ["", "日本語学科", "異文化コミュニケーション学科"],
             "二部": ["", "経済学部経済学科", "法学部法律学科", "商学部マーケティング学科"]
        ],
        "帝京大学":
            ["医学部": ["", "医学科"],
             "薬学部": ["", "薬学科"],
             "経済学部": ["", "経済学科", "国際経済学科", "地域経済学科", "経営学科", "観光経営学科"],
             "法学部": ["", "法律学科", "政治学科"],
             "文学部": ["", "日本文化学科", "史学科", "社会学科", "心理学科"],
             "外国語学部": ["", "外国語学科"],
             "教育学部": ["", "教育文化学科", "初等教育学科 初等教育コース", "初等教育学科 こども教育コース"],
             "理工学部": ["", "機械・精密システム工学科", "航空宇宙工学科 航空宇宙工学コース", "航空宇宙工学科 ヘリパイロットコース", "情報電子工学科", "バイオサイエンス学科", "情報科学科 通信教育課程"],
             "医療技術学部": ["", "視能矯正学科", "看護学科", "診療放射線学科", "臨床検査学科", "スポーツ医療学科 健康スポーツコース", "スポーツ医療学科 救急救命士コース", "柔道整復学科"],
             "福岡医療技術学部": ["", "理学療法学科", "作業療法学科", "看護学科", "診療放射線学科", "医療技術学科 救急救命士コース", "医療技術学科 臨床工学コース"],
        ],
        "神奈川大学":
            ["法学部": ["", "法律学科", "自治行政学科"],
             "経済学部": ["", "経済学科", "現代ビジネス学科"],
             "経営学部": ["", "国際経営学科"],
             "外国語学部": ["", "英語英文学科", "スペイン語学科", "中国語学科"],
             "国際日本学部": ["", "国際文化交流学科", "日本文化学科", "歴史民俗学科"],
             "人間科学部": ["", "人間科学科"],
             "理学部": ["", "総合理学プログラム", "数理・物理学科", "情報科学科", "化学科", "生物科学科"],
             "工学部": ["", "総合工学プログラム", "機械工学科", "電気電子情報工学科", "物質生命化学科", "情報システム創成学科", "経営工学科"],
             "建築学部": ["", "建築学科"]
        ],
        "成蹊大学":
            ["経済学部": ["", "経済数理学科", "現代経済学科"],
             "経営学部": ["", "総合経営学科"],
             "法学部": ["", "法律学科", "政治学科"],
             "文学部": ["", "英語英米文学科", "日本文学科", "国際文化学科", "現代社会学科"],
             "理工学部": [""]
        ],
        "明治学院大学":
            ["文学部": ["", "英文学科", "フランス文学科", "芸術学科"],
             "経済学部": ["", "経済学科", "経営学科", "国際経営学科"],
             "社会学部": ["", "社会学科", "社会福祉学科"],
             "法学部": ["", "法律学科", "消費情報環境法学科", "グローバル法学科", "政治学科"],
             "国際学部": ["", "国際学科", "国際キャリア学科"],
             "心理学部": ["", "心理学科", "教育発達学科"]
        ],
        "桜美林大学":
            ["リベラルアーツ学群": ["", "人文領域", "社会領域", "自然領域", "統合領域"],
             "グローバル・コミュニケーション学群": ["", "グローバル・コミュニケーション学類"],
             "ビジネスマネジメント学群": ["", "ビジネスマネジメント学類", "アビエーションマネジメント学類"],
             "健康福祉学群": ["", "社会福祉専修", "精神保健福祉専修", "健康科学専修", "保育専修"],
             "芸術文化学群": ["", "演劇・ダンス専修", "音楽専修", "ビジュアル・アーツ専修"],
             "航空・マネジメント学群": ["", "航空管制コース", "整備管理コース", "空港マネジメントコース", "フライト・オペレーションコース "]
        ],
        "名城大学":
            ["法学部": ["", "法学科"],
             "経営学部": ["", "経営学科", "国際経営学科"],
             "経済学部": ["", "経済学科", "産業社会学科"],
             "外国語学部": ["", "国際英語学科"],
             "人間学部": ["", "人間学科"],
             "都市情報学部": ["", "都市情報学科"],
             "理工学部": ["数学科", "電気電子工学科", "材料機能工学科", "応用化学科", "機械工学科", "交通機械工学科", "メカトロニクス工学科", "社会基盤デザイン工学科", "環境創造工学科", "建築学科"],
             "農学部": ["", "生物資源学科", "応用生物化学科", "生物環境科学科"],
             "薬学部": ["", "薬学科"],
             "情報工学部": ["", "情報工学科 先進プロジェクトコース", "情報工学科 総合コース"]
        ],
        "近畿大学":
            ["法学部": ["", "法律学科"],
             "経済学部": ["", "経済学科", "国際経済学科", "総合経済政策学科"],
             "経営学部": ["", "経営学科", "商学科", "会計学科", "キャリア・マネジメント学科"],
             "建築学部": ["", "建築工学専攻", "建築デザイン専攻", "住宅建築専攻", "企画マネジメント専攻"],
             "理工学部": ["", "理学科", "生命科学科", "応用化学科", "機械工学科", "電気電子工学科", "情報学科", "社会環境工学科"],
             "薬学部": ["", "医療薬学科", "創薬科学科"],
             "文芸学部": ["", "文学科", "芸術学科", "文化・歴史学科", "文化デザイン学科"],
             "総合社会学部": ["", "社会・マスメディア系専攻", "心理系専攻", "環境・まちづくり系専攻"],
             "国際学部": [""],
             "農学部": ["", "農業生産科学科", "水産学科", "応用生命化学科", "食品栄養学科", "環境管理学科", "生物機能科学科"],
             "医学部": ["", "医学科"],
             "生物理工学部": ["", "生物工学科", "遺伝子工学科", "食品安全工学科", "生命情報工学科", "人間環境デザイン工学科", "医用工学科"],
             "工学部": ["", "化学生命工学科", "機械工学科", "ロボティクス学科", "電子情報工学科", "情報学科", "建築学科"],
             "情報学部": [""],
             "産業理工学部": ["", "生物環境化学科", "電気電子工学科", "建築・デザイン学科", "情報学科", "経営ビジネス学科"],
             "短期大学部": [""],
             "通信教育部": [""]
        ],
        "立命館大学":
            ["法学部": ["", "法学科 法政展開", "法学科 司法特修", "法学科 公務行政特修"],
             "産業社会学部": ["", "現代社会学科 現代社会専攻", "現代社会学科 メディア社会専攻", "現代社会学科 スポーツ社会専攻", "現代社会学科 子ども社会専攻", "現代社会学科 人間福祉専攻"],
             "国際関係学部": ["", "国際関係学科 国際関係学専攻", "国際関係学科 グローバル・スタディーズ専攻", "アメリカン大学・立命館大学国際連携学科"],
             "文学部": ["", "人文学科 人間研究学域", "人文学科 日本文学研究学域", "人文学科 日本史研究学域", "人文学科 東アジア研究学域", "人文学科 国際文化学域", "人文学科 地域研究学域", "人文学科 国際コミュニケーション学域", "人文学科 言語コミュニケーション学域"],
             "映像学部": ["", "映像学科"],
             "経営学部": ["", "国際経営学科", "経営学科"],
             "政策科学部": ["", "政策科学科 政策科学専攻", "政策科学科 Community and Regional Policy Studies 専攻"],
             "総合心理学部": ["", "総合心理学科"],
             "グローバル教養学部": ["", "グローバル教養学科"],
             "経済学部": ["", "経済学科 国際専攻", "経済学科 経済専攻"],
             "スポーツ健康科学部": ["", "スポーツ健康科学科"],
             "食マネジメント学部": ["", "食マネジメント学科"],
             "理工学部": ["", "数理科学科", "物理科学科", "電気電子工学科", "電子情報工学科", "機械工学科", "ロボティクス学科", "環境都市工学科", "建築都市デザイン学科"],
             "情報理工学部": ["", "情報理工学科"],
             "生命科学部": ["", "応用化学科", "生物工学科", "生命情報学科", "生命医科学科"],
             "薬学部": ["" ,"薬学科", "創薬科学科"]
        ],
        "関西大学":
            ["法学部": ["", "法学政治学科"],
             "文学部": ["", "英米文学英語学専修", "英米文化専修", "国語国文学専修", "哲学倫理学専修", "比較宗教学専修", "芸術学美術史専修", "ヨーロッパ文化専修", "日本史・文化遺産学専修", "世界史専修", "地理学・地域環境学専修", "教育文化専修、初等教育学専修", "心理学専修", "映像文化専修", "文化共生学専修", "アジア文化専修"],
             "経済学部": ["", "経済政策コー ス", "歴史・思想コース", "産業・企業経済 コース", "国際経済コース"],
             "商学部": ["", "流通専修", "ファイナンス専修", "国際ビジネス専修", "マネジメント専修", "会計専修"],
             "社会学部": ["", "社会学専攻", "心理学専攻", "メディア専攻", "社会システムデザイン専攻"],
             "政策創造学部": ["", "政策学科 政治経済専修", "政策学科 地域経営専修", "国際アジア学科"],
             "外国語学部": ["", "外国語学科"],
             "人間健康学部": ["", "スポーツと健康コース", "福祉と健康コース"],
             "総合情報学部": ["", "総合情報学科"],
             "社会安全学部": ["", "安全マネジメント学科"],
             "システム理工学部": ["", "数学科", "物理・応用物理学科", "機械工学科", "電気電子情報工学科"],
             "環境都市工学部": ["", "建築学科", "都市システム工学科", "エネルギー・環境化学工学科"],
             "化学生命工学部": ["", "化学・物質工学科", "生命・生物工学科"]
        ],
        "同志社大学":
            ["神学部": ["", "神学科"],
             "文学部": ["", "英文学科", "哲学科", "美学芸術学科", "文化史学科", "国文学科"],
             "社会学部": ["", "社会学科", "社会福祉学科", "メディア学科", "産業関係学科", "教育文化学科"],
             "法学部": ["", "法律学科", "政治学科"],
             "経済学部": ["", "経済学科"],
             "商学部": ["", "商学科 商学総合コース", "商学科 フレックス複合コース"],
             "政策学部": ["", "政策学科"],
             "文化情報学部": ["", "文化情報学科"],
             "理工学部": ["", "インテリジェント情報工学科", "情報システムデザイン学科", "電気工学科", "電子工学科", "機械システム工学科", "機械理工学科", "機能分子・生命化学科", "化学システム創成工学科", "環境システム学科", "数理システム学科"],
             "生命医科学部": ["", "医工学科", "医情報学科", "医生命システム学科"],
             "スポーツ健康科学部": ["", "スポーツ健康科学科"],
             "心理学部": ["", "心理学科"],
             "グローバル・コミュニケーション学部": ["", "英語コース", "中国語コース"],
             "グローバル地域文化学部": ["", "ヨーロッパコース", "アジア・太平洋コース", "アメリカコース"]
        ],
        "関西学院大学":
            ["神学部": ["", "キリスト教伝道者コース", "キリスト教思想・文化コース"],
             "文学部": ["", "文化歴史学科", "総合心理科学科", "文学言語学科"],
             "社会学部": ["", "現代社会学専攻分野", "データ社会学専攻分野", "フィールド社会学専攻分野", "フィールド文化学専攻分野", "メディア・コミュニケーション学専攻分野", "社会心理学専攻分野"],
             "法学部": ["", "法律学科", "政治学科"],
             "経済学部": ["", "日本経済と財政・金融コース", "日本の企業と家計コース", "世界経済の歴史・思想と文化コース", "グローバル経済と環境・資源コース", "地域政策コース"],
             "商学部": ["", "経営コース", "会計コース", "マーケティングコース", "ファイナンスコース", "ビジネス情報コース", "国際ビジネスコース"],
             "人間福祉学部": ["", "社会福祉学科", "社会起業学科", "人間科学科"],
             "国際学部": ["", "北米研究コース", "アジア研究コース"],
             "教育学部": ["", "幼児教育コース", "初等教育コース", "教育科学"],
             "総合政策学部": ["", "総合政策学科", "メディア情報学科", "都市政策学科", "国際政策学科"],
             "理学部": ["", "数理科学科", "物理・宇宙学科", "化学科"],
             "工学部": ["", "物質工学課程", "電気電子応用工学課程", "情報工学課程", "知能・機械工学課程"],
             "生命環境学部": ["", "生物科学科", "生命医科学科", "環境応用化学科"],
             "建築学部": ["", "建築学科"]
        ],
        "龍谷大学":
            ["文学部": ["", "真宗学科", "仏教学科", "哲学科 哲学専攻", "哲学科 教育学専攻", "臨床心理学科", "歴史学科 日本史学専攻", "歴史学科 東洋史学専攻", "歴史学科 仏教史学専攻", "歴史学科 文化遺産学専攻", "日本語日本文学科", "英語英米文学科"],
             "経済学部": ["", "現代経済学科", "国際経済学科"],
             "経営学部": ["", "経営学科"],
             "法学部": ["", "法律学科"],
             "政策学部": ["", "政策学科"],
             "国際学部": ["", "グローバルスタディーズ学科", "国際文化学科"],
             "先端理工学部": ["", "数理・情報科学課程", "知能情報メディア課程", "電子情報通信課程", "機械工学・ロボティクス課程", "応用化学課程", "環境生態工学課程"],
             "社会学部": ["", "社会学科", "コミュニティマネジメント学科", "現代福祉学科"],
             "農学部": ["", "植物生命科学科", "資源生物科学科", "食品栄養学科", "食料農業システム学科"]
        ],
        "福岡大学":
            ["人文学部": ["", "文化学科", "歴史学科", "日本語日本文学科", "教育・臨床心理学科", "英語学科", "ドイツ語学科", "フランス語学科", "東アジア地域言語学科"],
             "法学部": ["", "法律学科", "経営法学科"],
             "経済学部": ["", "経済学科", "産業経済学科"],
             "商学部": ["", "商学科", "経営学科", "貿易学科"],
             "商学部第二部": ["", "商学科"],
             "理学部": ["", "応用数学科", "物理科学科", "化学科", "地球圏科学科"],
             "工学部": ["", "機械工学科", "電気工学科", "電子情報工学科", "化学システム工学科", "社会デザイン工学科", "建築学科"],
             "医学部": ["", "医学科", "看護学科"],
             "薬学部": ["", "薬学科"],
             "スポーツ科学部": ["", "スポーツ科学科", "健康運動科学科"]
        ],
        "武庫川女子大学":
            ["文学部": ["", "日本語日本文学科", "英語文化学科", "心理・社会福祉学科"],
             "教育学部": ["", "教育学科"],
             "健康・スポーツ科学部": ["", "健康・スポーツ科学科"],
             "生活環境学部": ["", "生活環境学科", "情報メディア学科"],
             "食物栄養科学部": ["", "食物栄養学科", "食創造科学科"],
             "建築学部": ["", "建築学科", "景観建築学科"],
             "音楽学部": ["", "演奏学科", "応用音楽学科"],
             "薬学部": ["", "薬学科", "健康生命薬科学科"],
             "看護学部": ["", "看護学科"],
             "経営学部": ["", "経営学科"]
        ],
        "大妻女子大学":
            ["家政学部": ["", "被服学科", "食物学科", "児童学科", "ライフデザイン学科"],
             "文学部": ["", "日本文学科", "英語英文学科", "コミュニケーション文化学科"],
             "社会情報学部": ["", "社会生活情報学専攻", "環境情報学専攻", "情報デザイン専攻"],
             "人間関係学部": ["", "人間関係学科", "人間福祉学科"],
             "比較文化学部": ["", "アジア文化コース", "アメリカ文化コース", "ヨーロッパ文化コース"]
        ],
        "日本女子大学":
            ["家政学部": ["", "児童学科", "食物学科", "住居学科", "被服学科", "家政経済学科"],
             "文学部": ["", "日本文学科", "英文学科", "史学科"],
             "人間社会学部": ["", "現代社会学科", "社会福祉学科", "教育学科", "心理学科", "文化学科"],
             "理学部": ["数物科学科", "物質生物科学科"]
        ],
        "大阪大学":
            ["文学部": ["", "人文学科"],
             "人間科学部": ["", "人間科学科"],
             "外国語学部": ["", "日本語専攻", "ポルトガル語専攻", "スペイン語専攻", "イタリア語専攻", "フランス語専攻", "英語専攻", "ドイツ語専攻", "スウェーデン語専攻", "デンマーク語専攻", "ハンガリー語専攻", "ロシア語専攻", "スワヒリ語専攻", "トルコ語専攻", "ペルシア語専攻", "アラビア語専攻", "ウルドゥー語専攻", "ヒンディー語専攻", "ビルマ語専攻", "ベトナム語専攻", "タイ語専攻", "フィリピン語専攻","インドネシア語専攻", "モンゴル語専攻","朝鮮語専攻","中国語専攻"],
             "法学部": ["", "国際公共政策学科", "法学科"],
             "経済学部": ["", "経済・経営学科"],
             "理学部": ["", "生物科学科", "物理学科", "数学科", "化学科"],
             "医学部": ["", "保健学科", "v"],
             "歯学部": ["", "歯学科"],
             "薬学部": ["", "薬学科"],
             "工学部": ["", "環境・エネルギー工学科", "電子情報工学科", "地球総合工学科", "応用理工学科", "応用自然科学科"],
             "基礎工学部": ["", "電子物理科学科", "システム科学科", "化学応用科学科", "情報科学科"]
        ],
        "東京大学":
            ["教養学部": ["", "教養学科", "学際科学科", "統合自然科学科"],
             "法学部": ["", "第１類", "第２類", "第３類"],
             "経済学部": ["", "経済学科", "経営学科", "金融学科"],
             "文学部": ["", "人文学科"],
             "教育学部": ["", "総合教育科学科"],
             "工学部": ["", "社会基盤学科", "建築学科", "都市工学科", "機械工学科", "機械情報工学科", "航空宇宙工学科", "精密工学科", "電子情報工学科", "電気電子工学科", "物理工学科", "計数工学科", "マテリアル工学科", "応用化学科", "化学システム工学科", "化学生命工学科", "システム創成学科"],
             "理学部": ["", "数学科", "情報科学科", "物理学科", "天文学科", "地球惑星物理学科", "地球惑星環境学科", "化学科", "生物化学科", "生物学科", "生物情報科学科"],
             "農学部": ["", "応用生命科学課程", "環境資源科学課程", "獣医学課程"],
             "薬学部": ["", "薬学科", "薬科学科"],
             "医学部": ["", "医学科", "健康総合科学科"]
        ],
        "京都大学":
            ["総合人間学部": ["", "総合人間学科"],
             "文学部": ["", "人文学科"],
             "教育学部": ["", "教育科学科"],
             "法学部": [""],
             "経済学部": ["", "経済経営学科"],
             "理学部": ["", "理学科"],
             "医学部": ["", "医学科 ", "人間健康科学科"],
             "薬学部": ["", "薬科学科", "薬学科"],
             "工学部": ["", "地球工学科", "建築学科", "物理工学科", "電気電子工学科", "情報学科", "工業化学科"],
             "農学部": ["", "資源生物科学科", "応用生命科学科", "地域環境工学科", "食料・環境経済学科", "森林科学科", "食品生物科学科"]
        ],
        "名古屋大学":
            ["文学部": ["", "人文学科"],
             "教育学部": ["", "人間発達科学科"],
             "法学部": ["", "法律・政治学科"],
             "経済学部": ["", "経済学科", "経営学科"],
             "情報学部": ["", "自然情報学科", "人間・社会情報学科", "コンピュータ科学科"],
             "理学部": ["", "数理学科", "物理学科", "化学科", "生命理学科", "地球惑星科学科"],
             "医学部": ["", "医学科", "保健学科"],
             "工学部": ["", "化学生命工学科", "物理工学科", "マテリアル工学科", "電気電子情報工学科", "機械・航空宇宙工学科", "エネルギー理工学科", "環境土木・建築学科"],
             "農学部": ["", "生物環境科学科", "資源生物科学科", "応用生命科学科"]
        ],
        "九州大学":
            ["共創学部": ["", "共創学科"],
             "文学部": ["", "人文学科"],
             "教育学部": [""],
             "法学部": [""],
             "経済学部": ["", "経済・経営学科", "経済工学科"],
             "理学部": ["", "物理学科", "化学科", "地球惑星科学科", "数学科", "生物学科"],
             "医学部": ["", "医学科", "生命科学科", "保健学科"],
             "歯学部": ["", "歯学科"],
             "薬学部": ["", "創薬科学科", "臨床薬学科"],
             "工学部": ["", "電気情報工学科", "材料工学科", "応用化学科", "化学工学科", "融合基礎工学科", "機械工学科", "航空宇宙工学科", "量子物理工学科", "船舶海洋工学科", "地球資源システム工学科", "土木工学科", "建築学科"],
             "芸術工学部": ["", "環境設計コース", "インダストリアルデザインコース", "未来構想デザインコース", "メディアデザインコース", "音響設計コース"],
             "農学部": ["", "生物資源環境学科"]
        ],
        "神戸大学":
            ["文学部": ["", "人文学科"],
             "国際人間科学部": ["", "グローバル文化学科", "発達コミュニティ学科", "環境共生学科", "子ども教育学科"],
             "法学部": ["", "法律学科"],
             "経済学部": ["", "経済学科"],
             "経営学部": ["", "経営学科"],
             "理学部": ["", "数学科", "物理学科", "化学科", "生物学科", "惑星学科"],
             "医学部": ["", "医学科", "保健学科 看護学専攻", "保健学科 検査技術科学専攻", "保健学科 理学療法学専攻", "保健学科 作業療法学専攻"],
             "工学部": ["", "建築学科", "市民工学科", "電気電子工学科", "機械工学科", "応用化学科", "情報知能工学科"],
             "農学部": ["", "食料環境システム学科", "資源生命科学科", "生命機能科学科"],
             "海洋政策科学部": ["", "海洋政策科学科"]
        ],
        "北海道大学":
            ["文学部": ["", "人文科学科"],
             "教育学部": ["", "教育学科"],
             "法学部": ["", "法学課程"],
             "経済学部": ["", "経済学科", "経営学科"],
             "理学部": ["", "数学科", "物理学科", "化学科", "生物科学科", "地球惑星科学科"],
             "医学部": ["", "医学科", "保健学科"],
             "歯学部": ["", "歯学科"],
             "薬学部": ["", "薬科学科", "薬学科"],
             "工学部": ["", "応用理工系学科", "情報エレクトロニクス学科", "機械知能工学科", "環境社会工学科"],
             "農学部": ["", "生物資源科学科", "応用生命科学科", "生物機能化学科", "森林科学科", "畜産科学科", "生物環境工学科", "農業経済学科"],
             "獣医学部": ["", "共同獣医学課程"],
             "水産学部": ["", "海洋生物科学科", "海洋資源科学科", "増殖生命科学科", "資源機能化学科"]
        ],
        "東北大学":
            ["文学部": ["", "人文社会学科"],
             "教育学部": ["", "教育科学科"],
             "法学部": ["", "法学科"],
             "経済学部": ["", "経済学科", "経営学科"],
             "理学部": ["", "数学系 数学科", "物理系 物理学科", "物理系 宇宙地球物理学科", "化学系 化学科", "地球科学系 地圏環境科学科", "地球科学系 地球惑星物質科学科", "生物系 生物学科"],
             "医学部": ["", "医学科", "保健学科"],
             "歯学部": ["", "歯学科"],
             "薬学部": ["", "創薬科学科", "薬学科"],
             "工学部": ["", "機械知能・航空工学科", "電気情報物理工学科", "化学・バイオ工学科", "材料科学総合学科", "建築・社会環境工学科"],
             "農学部": ["", "生物生産科学科", "応用生物化学科"]
        ],
        "東京工業大学":
            ["理学院": ["", "数学系", "物理学系", "化学系", "地球惑星科学系"],
             "工学院": ["", "機械系", "システム制御系", "電気電子系", "情報通信系", "経営工学系"],
             "物質理工学院": ["", "材料系", "応用化学系"],
             "情報理工学院": ["", "数理・計算科学系", "情報工学系"],
             "生命理工学院": ["", "生命理工学系"],
             "環境・社会理工学院": ["", "建築学系", "土木・環境工学系", "融合理工学系"]
        ],
        "一橋大学":
            ["商学部": ["", "経営学科", "商学科"],
             "経済学部": ["", "経済学科"],
             "法学部": ["", "法律学科"],
             "社会学部": ["", "社会学科"]
        ],
        "横浜国立大学":
            ["教育学部": ["", "言語・文化・社会系教育コース", "自然・生活系教育コース", "芸術・身体・発達支援系教育コース"],
             "経済学部": ["", "経済学科"],
             "経営学部": ["", "経営学科"],
             "理工学部": ["", "機械・材料・海洋系学科", "化学・生命系学科", "数物・電子情報系学科"],
             "都市科学部": ["", "都市社会共生学科", "建築学科", "都市基盤学科", "環境リスク共生学科"]
        ],
        "筑波大学":
            ["人文・文化学群": ["", "人文学類", "比較文化学類", "日本語・日本文化学類"],
             "社会・国際学群": ["", "社会学類", "国際総合学類"],
             "人間学群": ["", "教育学類", "心理学類", "障害科学類"],
             "生命環境学群": ["", "生物学類", "生物資源学類", "地球学類"],
             "理工学群": ["", "数学類", "物理学類", "化学類", "応用理工学類", "工学システム学類", "社会工学類"],
             "情報学群": ["", "情報科学類", "情報メディア創成学類", "知識情報・図書館学類"],
             "医学群": ["", "医学類", "看護学類", "医療科学類"],
             "体育専門学群": [""],
             "芸術専門学群": [""]
        ],
        "京都産業大学":
            ["経済学部": ["", "経済学科"],
             "経営学部": ["", "マネジメント学科"],
             "法学部": ["", "法律学科", "法政策学科"],
             "現代社会学部": ["", "現代社会学科", "健康スポーツ社会学科"],
             "国際関係学部": ["", "国際関係学科"],
             "外国語学部": ["", "英語学科", "ヨーロッパ言語学科", "アジア言語学科"],
             "文化学部": ["", "京都文化学科", "国際文化学科"],
             "理学部": ["", "数理科学科", "物理科学科", "宇宙物理・気象学科"],
             "情報理工学部": ["", "情報理工学科"],
             "生命科学部": ["", "先端生命科学科", "産業生命科学科"]
        ],
        "東京農業大学":
            ["農学部": ["", "農学科", "動物科学科", "生物資源開発学科", "デザイン農学科"],
             "応用生物科学部": ["", "農芸化学科", "醸造科学科", "食品安全健康学科", "栄養科学科"],
             "生命科学部": ["", "バイオサイエンス学科", "分子生命化学科", "分子微生物学科"],
             "地域環境科学部": ["", "森林総合科学科", "生産環境工学科", "造園科学科", "地域創成科学科"],
             "国際食料情報学部": ["", "国際農業開発学科", "食料環境経済学科", "国際バイオビジネス学科", "国際食農科学科"],
             "生物産業学部": ["", "北方圏農学科", "海洋水産学科", "食香粧化学科", "自然資源経営学科"]
        ],
        "中京大学":
            ["国際学部": ["", "言語文化学科", "国際学科"],
             "文学部": ["", "歴史文化学科", "日本文学科", "言語表現学科"],
             "心理学部": ["", "心理学科"],
             "法学部": ["", "法律学科"],
             "経済学部": ["", "経済学科"],
             "経営学部": ["", "経営学科"],
             "総合政策学部": ["", "総合政策学科"],
             "現代社会学部": ["", "社会学専攻", "コミュニティ学専攻", "社会福祉学専攻", "国際文化専攻"],
             "工学部": ["", "機械システム工学科", "電気電子工学科", "情報工学科", "メディア工学科"],
             "スポーツ科学部": ["", "スポーツマネジメント学科", "スポーツ健康科学科", "トレーナー学科", "スポーツ教育学科", "競技スポーツ科学科"]
        ],
        "国士舘大学":
            ["政経学部": ["", "政治行政学科", "経済学科"],
             "体育学部": ["", "体育学科", "武道学科", "スポーツ医科学科", "こどもスポーツ教育学科"],
             "理工学部": ["", "機械工学系", "電子情報学系", "建築学系", "まちづくり学系", "人間情報学系", "基礎理学系"],
             "法学部": ["", "法律学科", "現代ビジネス法学科"],
             "文学部": ["", "教育学科", "史学地理学科", "文学科"],
             "２１世紀アジア学部": ["", "２１世紀アジア学科"],
             "経営学部": ["", "経営学科"]
        ],
    
    ]
    
    
    
    
    override func viewDidLoad() {
        super.viewDidLoad()

        
        facTextField.delegate = self
        depTextField.delegate = self
        
        pickerView.delegate = self
        pickerView.dataSource = self
        
        
        view.backgroundColor = .systemBackground
        
        navigationItem.rightBarButtonItem = UIBarButtonItem(title: "登録", style: .done, target: self, action: #selector(tapRightBarButton))
        navigationItem.leftBarButtonItem = UIBarButtonItem(title: " ← ", style: .done, target: self, action: #selector(cancelButton))
        navigationController?.navigationBar.tintColor = .label
        
        
        let toolbar = UIToolbar(frame: CGRect(x: 0, y: 0, width: view.frame.size.width, height: 45))
        let spacelItem = UIBarButtonItem(barButtonSystemItem: .flexibleSpace, target: self, action: nil)
        let doneItem = UIBarButtonItem(barButtonSystemItem: .done, target: self, action: #selector(done))
        toolbar.setItems([spacelItem, doneItem], animated: true)
        
        facTextField.inputView = pickerView
        depTextField.inputView = pickerView
        facTextField.inputAccessoryView = toolbar
        depTextField.inputAccessoryView = toolbar
        
        
    }
    
    @objc private func cancelButton() {
        navigationController?.popViewController(animated: true)
    }
    
    
    
    @objc private func tapRightBarButton() {
        
        guard let age = UserDefaults.standard.value(forKey: "year") as? String,
              let uni = UserDefaults.standard.value(forKey: "uni") as? String,
              let email = UserDefaults.standard.value(forKey: "email") as? String else {
            return
        }
        let safeMyEmail = DatabaseManager.safeEmail(emailAddress: email)
        
        guard let fac = facTextField.text,
              fac != "" else {
            
            return
        }
        UserDefaults.standard.setValue(fac, forKey: "fac")
        
        let dep = depTextField.text ?? ""
        
        let info = ProfileInfo(name: "ゲスト", picutre: "defalut", introduction: "", age: age, university: uni, faculty: fac, department: dep, friendCount: "0")
        
        alertMessage(safeMyEmail: safeMyEmail, info: info)
        
    }
    
    func alertMessage(safeMyEmail: String, info: ProfileInfo) {
        let alert: UIAlertController = UIAlertController(title: "", message: "学年と大学は登録後、変更できません。これで登録しますか？", preferredStyle: .alert)
        
        let defaultAction: UIAlertAction = UIAlertAction(title: "OK", style: .default, handler:{ [weak self]_ in
            DatabaseManager.shared.insertProfileInfo(myEmail: safeMyEmail, info: info, isPreviousInfo: nil) { [weak self](success) in
                if success == true {
                    let notificationVC = NotificationCheckViewController()
                    self?.navigationController?.pushViewController(notificationVC, animated: true)
                }
                else {
                    self?.alertUserError(alertMessage: "ネットワーク環境を見直して、もう一度試してください。")
                    print("error in BasicUserInfo (tapRightBarButton)")
                }
            }
        })
        
        let cancelAction: UIAlertAction = UIAlertAction(title: "もどる", style: .cancel, handler:{ _ in
        })
        
        alert.addAction(cancelAction)
        alert.addAction(defaultAction)
        
        present(alert, animated: true, completion: nil)
    }
    
    
    // 決定ボタン押下
    @objc private func done() {
        if active_textfield == facTextField {
            facTextField.endEditing(true)
            facTextField.text = facultyList[uni]?[pickerView.selectedRow(inComponent: 0)]
        }
        else if active_textfield == depTextField {
            depTextField.endEditing(true)
            guard let text3 = facTextField.text else {
                return
            }
            depTextField.text = departmentList[uni]?[text3]?[pickerView.selectedRow(inComponent: 0)]
        }
    }

    
    func textFieldShouldBeginEditing(_ textField: UITextField) -> Bool {
        active_textfield = textField

        switch textField {
        case facTextField:
            // 大学が選択されていた場合は学部を設定
            current_arr = facultyList[uni]!
        case depTextField :
            // 大学が選択されていた場合は学部を設定
            if let faculty = facTextField.text, faculty != "" {
                current_arr = departmentList[uni]![faculty]!
            } else {
                // 大学が選択されていない場合は指定を指示
                current_arr = departmentList["選んでください"]!["先に大学を選択してください"]!
            }
        default:
            print("default")
        }
        pickerView.reloadAllComponents()
        
        return true
    }
    
    func textFieldDidChangeSelection(_ textField: UITextField) {
        if textField == facTextField {
            depTextField.text = ""
        }
    }
    
    
    func numberOfComponents(in pickerView: UIPickerView) -> Int {
        return 1
    }
    
    func pickerView(_ pickerView: UIPickerView, numberOfRowsInComponent component: Int) -> Int {
        return current_arr.count
    }
    
    // ドラムロールの各タイトル
    func pickerView(_ pickerView: UIPickerView, titleForRow row: Int, forComponent component: Int) -> String? {
        return current_arr[row]
    }
    
    
    // ドラムロール選択時
    func pickerView(_ pickerView: UIPickerView, didSelectRow row: Int, inComponent component: Int) {
        active_textfield.text = current_arr[row]
    }
    
    
    
    func alertUserError(alertMessage: String) {
        let alert = UIAlertController(title: "",
                                      message: alertMessage,
                                      preferredStyle: .alert)
        alert.addAction(UIAlertAction(title: "OK",
                                      style: .cancel,
                                      handler: nil))
        present(alert, animated: true)
    }
    
    

}
